# Python - WORKSHEET 9
## Solutions

1. (D) All of the above
2. (A) True
3. (D) All of the above
4. (D) Error
5. (B) 2 dimensional
6. (D) 1 
7. (C) ix
8. (B) value, size
9. (B) Series can be passed into most NumPy methods expecting an ndarray.
    (C) A key difference between Series and ndarray is that operations between Series automatically align the data
    based on label
   (D) In pandas, Index values must be unique
10. (A) JSON ,(B) HTML,(C) CSV,(D) TXT

#### 11. Write a Pandas program to create and display a DataFrame from the following dictionary data and labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin',
'Jonas'],
 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
WORKSHEET
labels = ['I’, ‘II’, ‘III’, ‘IV’, ‘V’, ‘VI’, ‘VII’, ‘VIII’, ‘IX’, ‘X’]

In [1]:
import pandas as pd
import numpy as np

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin',
'Jonas'],
 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
  'labels':labels}



df = pd.DataFrame.from_dict(exam_data)
df.set_index('labels')

             name  score  attempts qualify
labels
a       Anastasia   12.5         1     yes
b            Dima    9.0         3      no
c       Katherine   16.5         2     yes
d           James    NaN         3      no
e           Emily    9.0         2      no
f         Michael   20.0         3     yes
g         Matthew   14.5         1     yes
h           Laura    NaN         1      no
i           Kevin    8.0         2      no
j           Jonas   19.0         1     yes

#### 12. Write a Pandas program to get the first 5 rows of the DataFrame created in Q11.

In [2]:
df.head()

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
3      James    NaN         3      no      d
4      Emily    9.0         2      no      e

#### 13. Write a Pandas program to select the 'name' and 'score' columns of the DataFrame created in Q11.

In [3]:
df[['name', 'score']]

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

#### 14. Write a Pandas program to select 'name' and 'score' columns in row indexes 3, 5, 6, 8 from the DataFrame created in Q11.

In [4]:
print(df[['name', 'score']].iloc[[3, 5, 6,8]])

      name  score
3    James    NaN
5  Michael   20.0
6  Matthew   14.5
8    Kevin    8.0

#### 15.Write a Pandas program to select the rows where the score is between 15 and 20 (inclusive) from the DataFrame created in Q11.

In [5]:
print(df[df['score'].between(15, 20)])

        name  score  attempts qualify labels
2  Katherine   16.5         2     yes      c
5    Michael   20.0         3     yes      f
9      Jonas   19.0         1     yes      j

# End of Document